Config/InformationRegisters/НастройкиВыбораОтветственныхСотрудниковЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВыбораОтветственныхСотрудниковЦБ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособВыбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособВыбораОтветственногоЦБ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИмениРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ЗначениеРеквизитовПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначениеРеквизитовПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВидаОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИмениРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/НастройкиВыбораОтветственныхСотрудниковЦБ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Элементы.ВидОбъекта.СписокВыбора.Добавить(ТекущийОбъект.ВидОбъекта);
	ПолучитьРеквизитыОбъекта();
	Элементы.ВидОбъекта.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ВидОбъекта") Тогда
		
		Запись.ВидОбъекта = Параметры.ЗначенияЗаполнения.ВидОбъекта;
		ПолучитьРеквизитыОбъекта();
		
	ИначеЕсли ЗначениеЗаполнено(Запись.ВидОбъекта) Тогда
		
		ПолучитьРеквизитыОбъекта();
		
	КонецЕсли;
	
	ВозможныеИОМ = РегистрыСведений.ЗначениеРеквизитовПоУмолчанию.ВозможныеИОМ();
	
	Элементы.ВидОбъекта.ПараметрыВыбора = Новый ФиксированныйМассив(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый ПараметрВыбора("Отбор.Ссылка", ВозможныеИОМ)));
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбъектМетаданные = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ТекущийОбъект.ВидОбъекта); 
	МассивИмен = СтрРазделить(ТекущийОбъект.ИмяРеквизита, ".");
	Если МассивИмен.Количество() > 1 Тогда 
		ТабЧасть = ОбъектМетаданные.ТабличныеЧасти.Найти(МассивИмен[0]);
		Если ТабЧасть <> Неопределено Тогда
			ТекущийОбъект.ПредставлениеИмениРеквизита = ?(ПустаяСтрока(ТабЧасть.Синоним), ТабЧасть.Имя, ТабЧасть.Синоним);
			РеквизитТЧ = ТабЧасть.Реквизиты.Найти(МассивИмен[1]);
			Если РеквизитТЧ <> Неопределено Тогда 
				ТекущийОбъект.ПредставлениеИмениРеквизита = ТекущийОбъект.ПредставлениеИмениРеквизита + "." 
				+ ?(ПустаяСтрока(РеквизитТЧ.Синоним), РеквизитТЧ.Имя, РеквизитТЧ.Синоним);
			Иначе
				ТекущийОбъект.ПредставлениеИмениРеквизита = ""; 
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли МассивИмен.Количество() = 1 Тогда  
		РеквизитТЧ = ОбъектМетаданные.Реквизиты.Найти(МассивИмен[0]);	
		Если РеквизитТЧ <> Неопределено Тогда 
			ТекущийОбъект.ПредставлениеИмениРеквизита = ?(ПустаяСтрока(РеквизитТЧ.Синоним), РеквизитТЧ.Имя, РеквизитТЧ.Синоним);
		ИначеЕсли ТекущийОбъект.ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаОтветственныйИсполнитель() Тогда
			ТекущийОбъект.ПредставлениеИмениРеквизита = НСтр("ru = 'Бухгалтерская операция.Бухгалтер'");	 
		Иначе
			ТекущийОбъект.ПредставлениеИмениРеквизита = ""; 
		КонецЕсли; 
	Иначе
		ТекущийОбъект.ПредставлениеИмениРеквизита = ""; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОбъектаПриИзменении(Элемент)
	ПолучитьРеквизитыОбъекта();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьРеквизитыОбъекта() 
	
	СписокВыбора = Элементы.ИмяРеквизита.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Запись.ВидОбъекта) Тогда
		Запись.ИмяРеквизита = ""; 
		Запись.ПредставлениеИмениРеквизита = "";  
		Возврат;
	КонецЕсли;	
		
	СписокРеквизитов = БухгалтерскийУчетПовтИсп.ПолучитьСписокРеквизитовОбъектаМетаданных(Запись.ВидОбъекта);
	
		
	Для каждого ТекЗначение Из СписокРеквизитов Цикл
		МассивИмен = СтрРазделить(ТекЗначение.Значение, ".");
		Если МассивИмен.Количество() > 1 Тогда
			ОписаниеТипов = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Запись.ВидОбъекта).ТабличныеЧасти[МассивИмен[0]].Реквизиты[МассивИмен[1]].Тип;
		Иначе
			ОписаниеТипов = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Запись.ВидОбъекта).Реквизиты[ТекЗначение.Значение].Тип; 
		КонецЕсли;
		Если ОписаниеТипов.СодержитТип(Тип("СправочникСсылка.Сотрудники")) Тогда
			СписокВыбора.Добавить(ТекЗначение.Значение, ТекЗначение.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Если Справочники.ТиповыеОперации.ЕстьТиповаяОперацияВидаДокумента(Запись.ВидОбъекта) Тогда
		СписокВыбора.Добавить(
			БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаОтветственныйИсполнитель(),
			НСтр("ru = 'Бухгалтерская операция.Бухгалтер'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
